//
//  datas.swift
//  Hw2
//
//  Created by blaire on 2019/10/16.
//  Copyright © 2019 AppCoda. All rights reserved.
//

import Foundation

let 牙龍種 = [monsterData(name: "大兇豺龍", data: "食欲旺盛，在空腹的時候會變得很暴躁。 完全吞下獵物後腹部會膨漲，會大膽地以巨大的腹部發動攻擊。集中攻擊腹部成功詀牠吐出獵物的話，就能有效率地弱化牠了。"),
monsterData(name: "大兇顎龍", data: "習慣與凶顎龍聯手進行集體狩獵，所以狩獵時的重點是必須討伐或使凶顎龍膽怯，在應對的同時去除威脅。破壞牙的話麻痺毒的效果也會減弱。"),
monsterData(name: "飛雷龍", data: "會在林本與地面間自由移動，必須注意來自死角的攻擊。狩獵時的重點是必須將維持在視野裡，阻止牠移動以及變成帶電狀態。"),
monsterData(name: "慘爪龍", data: "要注意受到尖銳利爪攻擊時的裂傷狀態。利用陷阱引誘或是刺激暴走使牠陷入疲勞狀態，如此就能夠製造破綻趁虛而入了。"),
monsterData(name: "雷狼龍", data: "拥有野狼一般的外表的牙龙种怪物，生活在充满茂密树木的群山之中，高山峻岭对它来说如履平地，利用附着于身的超电雷光虫，来使自己的身体带电，同时又能使出仿佛街舞一般的招式和强劲的臂力。")]

let 牙獸種 = [monsterData(name: "青熊獸", data: "主要栖息于溪流和孤岛。平常四脚行动，在遇见猎人之后会双脚站立，用发达的上肢进攻，喜好蜂蜜。"),
monsterData(name: "奇猿狐", data: "有尖锐爪子和巨大耳朵的灵巧怪物，会利用茂密的树丛进行移动，还可以在空中进行短暂的滑行。生气时会将大耳朵覆盖住脸来恐吓对手"),
monsterData(name: "金獅子", data: "威猛的狂王，用来指代金狮子的词语有很多，但人们对其详细的生态情况却知之甚少。和其他牙兽种不同，关于金狮子的生态研究基本上都是由专业研究古龙的学者来立案调查"),
monsterData(name: "雪獅子", data: "雪狮子王，生活在雪山，属于牙兽类，体表覆盖着雪白的长毛，头部的一圈长毛酷似狮鬃，所以被赋予“雪狮子”。")]

let 海龍種 = [monsterData(name: "海龍", data: "它能够在海中自由灵活的穿梭，并进行和陆地所不同的，全方位的攻击。海龙不仅把狩猎之旅引入海底，还让猎人们见识到了来自大洋深处最为可怕的实力。"),
monsterData(name: "泡狐龍", data: "泡狐龍是唯一有體毛的海龍種，出現於溪流等地區，身手敏捷而且柔軟性很高，從體內利用其體內特殊的分泌液可以奪取獵物的自由。"),
monsterData(name: "炎戈龍", data: "是火山食物链的绝对顶端掠食者，在岩浆中生活的海龙种怪物。"),
monsterData(name: "水獸", data: "是一种中体积的海龙，头上生有皇冠般的头冠，颈部则长着巨大的可以存水的海绵质，作为肉食水兽的首领，水兽本身也是王一样的存在。")]

let 古龍種 = [monsterData(name: "炎王龍", data: "可吐出灼热的气息的古龙种，非常的凶猛，身体立起来的时候，上升的火焰将会燃尽周围的一切。拥有强韧的四肢和优美的飞翼，燃烧的胡须是他主要的特征。"),
monsterData(name: "鋼龍", data: "钢龙又名风翔龙，是CAPCOM开发的怪物猎人系列中的古龙种怪物。"),
monsterData(name: "麒麟", data: "是怪物猎人中少数以汉语命名的怪物之一，其原型也来自与神话中的麒麟，为一类特殊的小型古龙种，用自在操纵的落雷，额上生长的角和缠在身体的电击攻击猎人。而且速度非常迅速，被称为“雷神”"),
monsterData(name: "滅盡龍", data: "滅盡龍因為其行動純粹以破壞為目的，所以獲得如此頭銜的古龍。全身下上的尖刺除了獵人的攻擊外，甚至會因為自己的攻擊而損壞，但馬上就會再生出白色的尖刺，同時讓滅盡龍獲得更進一步的強化。")]

let 鳥龍種 = [monsterData(name: "毒妖鳥", data: "不僅擁有積極攻擊較弱對象的狡猾，也有在更強的魔物面前會示弱地縮起身體，然後一溜煙逃跑的特質，最好能利用這點。"),
monsterData(name: "搔鳥", data: "它們亦擅於抓住大石並置於身前以保護自己，也會以岩石敲打作為攻擊。"),
monsterData(name: "眩鳥", data: "發現獵物或天敵，發光器官就會張大，發出耀眼的閃光製造破綻。 ")]

let 飛龍種 = [monsterData(name: "雄火龍", data: "雄火龙是天空中飞翔的凶恶飞龙，不仅能够喷出高爆火球，还具有带毒的利爪，在广阔的领域猎杀猎物，被誉为“天空的王者”"),
monsterData(name: "角龍", data: "为栖息于沙漠地区的素食性飞龙。体型庞大，虽属于飞龙种却不擅长飞行。脾气极其暴躁，会对任何侵入其领地的生物发动攻击。"),
monsterData(name: "雌火龍", data: "与称霸天空的雄火龙不同，雌火龙盘踞于陆地，拥有与雄火龙不相上下的强力火焰攻击和剧毒的尾棘，在地面上追捕猎物，被誉为“大地女王”。"),
monsterData(name: "浮空龍", data: "沒有空氣可吐時移動就會受限，行容易出現破綻。所以要瞄準蓄積空氣的部位，或是刻意讓牠採取消空氣的行氣。"),
monsterData(name: "轟龍", data: "虽然飞行能力不如其他飞龙，但是性格十分凶暴，主要攻击方式是以发达的四肢突进，或用爪和颚发出强力一击。两种攻击方式威力都十分恐怖，而其招牌技能“龙车”又是猎人的噩梦。")]

let 兩生種 = [monsterData(name: "鬼蛙", data: "拥有两只巨大的獠牙（可破坏）它那犹如铲斗车般的大嘴可以轻松咬碎石块并且会对周围的生物产生爆炸效果。"),
monsterData(name: "化鮫", data: "化鲛是不断变化的 平常化鲛藏在水下，这点与鲨鱼很像。遇 到敌人时才钻出冰面攻击。感受到危险时 ，化鲛会愤怒。")]

let 魚龍種 = [monsterData(name: "泥魚龍", data: "利用泥漿捉拿獵物和保護自己，有時會對入侵其領域的魔物進行攻擊。 在沼地中行動迅速。"),
monsterData(name: "溶岩龍", data: "全身流動的岩漿冷卻固化後相當於堅硬的鎧甲，所以必須在火熱岩漿使熔岩軟化時加以攻擊。")]

let 草食種 = [monsterData(name: "甲殼龍", data: "被當作食材的魔物。但是外殼較硬，比草食龍更具攻擊性，所以無法簡單的取得牠的肉。蛋也有價值，被公會視為珍品。"),
monsterData(name: "草食龍",data: "被當作食材的草食魔物。膽小又文靜，當察知周圍有危險的話，就會開始逃走，偶爾也有會反擊的個體。")]

let 獸人種 = [monsterData(name: "艾露", data: "牠們喜愛的木天蓼道具。這些萌萌的魔物因為好奇心而進入人類社會，懂得種田、經營商店及烹飪，後期更懂得戰鬥。善良又勇敢的牠們更會將瀕死的獵人用木頭車高速送回營地，每次收取獵人任務三分之一的報酬。")]

let 甲蟲種 = [monsterData(name: "重甲蟲", data: "重甲虫是CAPCOM于2013年9月14日发售的怪物猎人4中登场的虚构怪物，首次出现于村5星任务《重量级の女帝》。"),
monsterData(name: "閣螳螂", data: "踞在沙漠中的上古废墟——旧砦迹内，喷吐丝线支撑着腐朽的城墙，从砂层下挖出一切可以使用的兵器攻击入侵者。")]

let 蛇龍種 = [monsterData(name: "水蛇龍", data: "为了形成在寒冷地带的迷彩效果，体色与通常种比起发生了很大的变化。"),
monsterData(name: "絞蛇龍", data: "绞蛇龙擅长利用尾巴和背部的鳞片震动大气，发出远超其他怪物咆哮的巨响，更可以利用声音发动能对肉体造成伤害的攻击。")]

let 獸龍種 = [monsterData(name: "土砂龍", data: "不僅身上固化的泥巴能提升防禦，也會潑灑泥巴作為攻擊手段。"),
monsterData(name: "恐暴龍", data: "贪吃成性的嗜血怪物。没有固定的领地，为了寻找食物在各地游荡。"),
monsterData(name: "骨槌龍", data: "滾動攻擊中受到傷害會失衡，此時再加以追擊就可能使其跌倒。跌倒時可以從身體上採集到骨素材。"),
monsterData(name: "爆鎚龍", data: "若是周遭有會爆炸的岩石，就需要注意巨大下顎的攻擊有可能造成引爆。"),
monsterData(name: "蠻顎龍", data: "蠻顎龍非常具有攻擊性，對其他大型怪物也會積極進攻。發怒時會張開背部的翼膜及頭冠，並且在攻擊時嘴部帶有燃燒。咽喉的特殊器官具備積火炎的特性，已確認牠能吐出強烈的火焰吐息。")]
